## 單臂路由

1. 分別設定連結虛擬機的介面為`vlan 10`跟`vlan 20`，連接router為`trunk` 

```
Switch(config-vlan)#int e0/0
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 10
Switch(config-if)#int e0/1
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 20
Switch(config-if)#do sh vlan br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/2, Et0/3
10   VLAN0010                         active    Et0/0
20   VLAN0020                         active    Et0/1
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
Switch(config-if)# int e0/2
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
```
```
Switch(config-if)#do sh vlan br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et0/2, Et0/3
10   VLAN0010                         active    Et0/0
20   VLAN0020                         active    Et0/1
1002 fddi-default                     act/unsup
1003 token-ring-default               act/unsup
1004 fddinet-default                  act/unsup
1005 trnet-default                    act/unsup
```

2. 設定router 虛擬介面
```
Router(config)#hostname R1
R1(config)#int e0/0
R1(config-if)#no sh
R1(config-if)#no shutdown
R1(config-if)#int e0/0.10
R1(config-subif)#encapsulation dot1Q 10
R1(config-subif)#exit
R1(config)#int e0/0.20
R1(config-subif)#encapsulation dot1Q 20
R1(config-subif)#int e0/0.10
R1(config-subif)#ip addr 192.168.1.254 255.255.255.0
R1(config-subif)#int e0/0.20
R1(config-subif)#ip addr 192.168.2.254 255.255.255.0
```

```
R1(config-subif)#do sh ip int br
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            unassigned      YES unset  up                    up
Ethernet0/0.10         192.168.1.254   YES manual up                    up
Ethernet0/0.20         192.168.2.254   YES manual up                    up
Ethernet0/1            unassigned      YES unset  administratively down down
Ethernet0/2            unassigned      YES unset  administratively down down
Ethernet0/3            unassigned      YES unset  administratively down down
```

```
VPCS> ping 192.168.1.254

84 bytes from 192.168.1.254 icmp_seq=1 ttl=255 time=1.556 ms
84 bytes from 192.168.1.254 icmp_seq=2 ttl=255 time=1.180 ms
84 bytes from 192.168.1.254 icmp_seq=3 ttl=255 time=1.211 ms
84 bytes from 192.168.1.254 icmp_seq=4 ttl=255 time=1.488 ms
84 bytes from 192.168.1.254 icmp_seq=5 ttl=255 time=1.378 ms

VPCS> ping 192.168.2.254

84 bytes from 192.168.2.254 icmp_seq=1 ttl=255 time=1.585 ms
84 bytes from 192.168.2.254 icmp_seq=2 ttl=255 time=1.474 ms
84 bytes from 192.168.2.254 icmp_seq=3 ttl=255 time=1.378 ms
84 bytes from 192.168.2.254 icmp_seq=4 ttl=255 time=3.415 ms
84 bytes from 192.168.2.254 icmp_seq=5 ttl=255 time=1.359 ms

VPCS> ping 192.168.2.1

84 bytes from 192.168.2.1 icmp_seq=1 ttl=63 time=7.397 ms
84 bytes from 192.168.2.1 icmp_seq=2 ttl=63 time=2.197 ms
84 bytes from 192.168.2.1 icmp_seq=3 ttl=63 time=1.700 ms
84 bytes from 192.168.2.1 icmp_seq=4 ttl=63 time=2.313 ms
84 bytes from 192.168.2.1 icmp_seq=5 ttl=63 time=2.148 ms
```


## 使用sw當作router
1. 在`sw3L`設定vtp server和`sw2L`共享vlan
2. 設定int vlan
