## 1.DHCP

```
Router>en
Router#conf t
Router(config)#int e0/0
Router(config-if)#ip addr 192.168.1.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#ip dhcp pool pool1
Router(dhcp-config)#network 192.168.1.0 255.255.255.0
Router(dhcp-config)#default-ro
Router(dhcp-config)#default-router 192.168.1.254
Router(dhcp-config)#dns-ser
Router(dhcp-config)#dns-server 8.8.8.8
Router(config)#ip dhcp excluded-address 192.168.1.101 192.168.1.254
```
```
VPCS> ip dhcp
DDORA IP 192.168.1.1/24 GW 192.168.1.254
```
```
VPCS> ip dhcp
DDORA IP 192.168.1.2/24 GW 192.168.1.254
```

```
Router(config)#int e0/1
Router(config-if)#ip addr 192.168.2.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#ip dhcp pool pool1
Router(dhcp-config)#network 192.168.2.0 255.255.255.0
Router(dhcp-config)#default-router 192.168.2.254
Router(dhcp-config)#dns-server
Router(dhcp-config)#dns-server 8.8.8.8
Router(dhcp-config)#exit
Router(config)#ip dhcp
Router(config)#ip dhcp excl
Router(config)#ip dhcp excluded-address 192.168.2.101 192.168.2.254
```

```
VPCS> ip dhcp
DDORA IP 192.168.2.1/24 GW 192.168.2.254

VPCS> ping 192.168.1.1

84 bytes from 192.168.1.1 icmp_seq=1 ttl=63 time=4.056 ms
84 bytes from 192.168.1.1 icmp_seq=2 ttl=63 time=1.783 ms
84 bytes from 192.168.1.1 icmp_seq=3 ttl=63 time=2.255 ms
84 bytes from 192.168.1.1 icmp_seq=4 ttl=63 time=2.154 ms
^C
VPCS> trace 192.168.1.1
trace to 192.168.1.1, 8 hops max, press Ctrl+C to stop
 1   192.168.2.254   1.311 ms  1.429 ms  1.282 ms
 2   *192.168.1.1   2.645 ms (ICMP type:3, code:3, Destination port unreachable)

VPCS> ping 192.168.2.2

84 bytes from 192.168.2.2 icmp_seq=1 ttl=64 time=1.011 ms
84 bytes from 192.168.2.2 icmp_seq=2 ttl=64 time=0.995 ms
^C
```
```
VPCS> ip dhcp
DDORA IP 192.168.2.2/24 GW 192.168.2.254
```

## 2.RIP
