
## Dynamic Trunking Protocol (DTP) 

conf t
switchport trunk en dot1
```
Switch>en
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int e0/0
Switch(config-if)#switchport trunk encapsulation dot1q
```
## VLAN Trunking Protocol (VTP)

[參考資料](http://www.tsnien.idv.tw/Manager_WebBook/chap8/8-3%20VTP%20%E7%B6%B2%E5%9F%9F%E8%88%87%E5%8D%94%E5%AE%9A.html)
1. 設定server，建立Domain、密碼
2. 設定mode trunk
3. 設定client，設定相同domain、密碼
4. 設定mode trunk
```
Switch(config)#vtp domain test
Changing VTP domain name from NULL to test
*Nov 22 06:13:14.374: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to test.
Setting device VTP password to cisco
Switch(config)#do sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : test
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : aabb.cc00.0100
Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 5
Configuration Revision            : 0
MD5 digest                        : 0x54 0x3F 0xEA 0x00 0x3B 0x4C 0xDC 0x30
                                    0x83 0xE2 0x18 0x85 0x18 0x61 0x88 0x67
```
```
Switch(config-vlan)#vlan 10
Switch(config-vlan)#name vlan10
Switch(config-vlan)#vlan 20
Switch(config-vlan)#name vlan20
Switch(config-vlan)#do sh vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : test
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : aabb.cc00.0400
Configuration last modified by 0.0.0.0 at 12-11-22 12:27:55
Local updater ID is 0.0.0.0 (no valid interface found)

Feature VLAN:
--------------
VTP Operating Mode                : Server
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 6
Configuration Revision            : 2
MD5 digest                        : 0xE0 0x37 0xA7 0xB6 0x4D 0xB0 0x27 0x3C
                                    0x06 0x22 0x48 0xA9 0xAB 0x8C 0x56 0x2B
```

```
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config-if)#do sh int tr

Port        Mode             Encapsulation  Status        Native vlan
Et0/0       on               802.1q         trunking      1
Et0/1       desirable        n-isl          trunking      1

Port        Vlans allowed on trunk
Et0/0       1-4094
Et0/1       1-4094

Port        Vlans allowed and active in management domain
Et0/0       1,10,20
Et0/1       1,10,20

Port        Vlans in spanning tree forwarding state and not pruned
Et0/0       1,10,20
Et0/1       1,10,20
```
```
Switch(config-vlan)#vlan 100
Switch(config-vlan)#do sh int tr

Port        Mode             Encapsulation  Status        Native vlan
Et0/0       on               802.1q         trunking      1
Et0/1       desirable        n-isl          trunking      1

Port        Vlans allowed on trunk
Et0/0       1-4094
Et0/1       1-4094

Port        Vlans allowed and active in management domain
Et0/0       1,10,20,50,100
Et0/1       1,10,20,50,100

Port        Vlans in spanning tree forwarding state and not pruned
Et0/0       1,10,20,50
Et0/1       1,10,20,50
```
## Client
通常Client端無法刪除vlan
```
Switch(config)#vtp mode client
Setting device to VTP Client mode for VLANS.
Switch(config)#vtp domain sw1
Changing VTP domain name from NULL to sw1
*Dec 11 12:49:53.044: %SW_VLAN-6-VTP_DOMAIN_NAME_CHG: VTP domain name changed to sw1.
Switch(config)#vtp password user
Setting device VTP password to user
Switch(config)#do show vtp status
VTP Version capable             : 1 to 3
VTP version running             : 1
VTP Domain Name                 : sw1
VTP Pruning Mode                : Disabled
VTP Traps Generation            : Disabled
Device ID                       : aabb.cc00.0500
Configuration last modified by 0.0.0.0 at 0-0-00 00:00:00

Feature VLAN:
--------------
VTP Operating Mode                : Client
Maximum VLANs supported locally   : 1005
Number of existing VLANs          : 5
Configuration Revision            : 0
MD5 digest                        : 0xD1 0x86 0xA4 0x83 0xBD 0x1A 0x58 0x8B
                                    0x87 0x8B 0x77 0x1E 0xA5 0x55 0x31 0x35
Switch(config)#int e0/0
Switch(config-if)#sw
Switch(config-if)#switchport en
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#switchport mode trunk
Switch(config-if)#do sh int tr

Port        Mode             Encapsulation  Status        Native vlan
Et0/0       on               802.1q         trunking      1
Et0/1       desirable        n-isl          trunking      1

Port        Vlans allowed on trunk
Et0/0       1-4094
Et0/1       1-4094

Port        Vlans allowed and active in management domain
Et0/0       1
Et0/1       1

Port        Vlans in spanning tree forwarding state and not pruned
Et0/0       1
Et0/1       1

Switch(config-if)#do sh int tr

Port        Mode             Encapsulation  Status        Native vlan
Et0/0       on               802.1q         trunking      1
Et0/1       desirable        n-isl          trunking      1

Port        Vlans allowed on trunk
Et0/0       1-4094
Et0/1       1-4094

Port        Vlans allowed and active in management domain
Et0/0       1,10,20,50,100
Et0/1       1,10,20,50,100

Port        Vlans in spanning tree forwarding state and not pruned
Et0/0       1
Et0/1       1
Switch(config)#no vlan 20
VTP VLAN configuration not allowed when device is in CLIENT mode.
```

`Configuration Revision`較大的一方會影響到其他機器
1. 關閉線路，設sw2為server，增加vlan，設回client
2. 開啟線路sw2會影響到sw1



## Spanning tree 
根據`address`選擇root
```
Switch(config)#hostname SW1
SW1(config)#do sh int
Ethernet0/0 is up, line protocol is up (connected)
  Hardware is AmdP2, address is aabb.cc00.0400 (bia aabb.cc00.0400)
  MTU 1500 bytes, BW 10000 Kbit/sec, DLY 1000 usec,
     reliability 255/255, txload 1/255, rxload 1/255
.
.
.
```
`root port`:與root 成本最低的port，其餘會關閉
```
sw2(config)#do sh spanning-tree

VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     aabb.cc00.0400
             Cost        100
             Port        1 (Ethernet0/0)
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     aabb.cc00.0500
             Hello Time   2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  300 sec

Interface           Role Sts Cost      Prio.Nbr Type
------------------- ---- --- --------- -------- --------------------------------
Et0/0               Root FWD 100       128.1    Shr
Et0/1               Desg FWD 100       128.2    Shr
Et0/2               Desg FWD 100       128.3    Shr
Et0/3               Desg FWD 100       128.4    Shr
```