## lookup
```
R1(config)#int lo 1
```
```
Router(config-if)#ip addr 1.2.3.4 255.255.255.0
Router(config-if)#do sh ip int brief           
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            unassigned      YES unset  administratively down down    
Ethernet0/1            unassigned      YES unset  administratively down down    
Ethernet0/2            unassigned      YES unset  administratively down down    
Ethernet0/3            unassigned      YES unset  administratively down down    
Loopback1              1.2.3.4         YES manual up                    up   
```
## telnet
1. set ip  
```
Router>en
Router#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int e0/0
Router(config-if)#do ping 192.168.2.2 255.255.255.0
```
```
line vty 0 4  
password 123456  
login 
transport input telnet
exit
```
```
telnet 192.168.2.1
```

## dhcp
```
R1(config)#int e0/1
R1(config-if)#ip addr dhcp
R1(config-if)#do sh ip int br
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            192.168.2.1     YES manual up                    up
Ethernet0/1            192.168.52.171  YES DHCP   up                    up
Ethernet0/2            unassigned      YES unset  administratively down down
Ethernet0/3            unassigned      YES unset  administratively down down
```

## ssh
```
R1(config-if)#username usern password userp
R1(config)#enable password user userp
R1(config)#ip domain-name test.com
R1(config)#crypto key generate rsa
The name for the keys will be: R1.test.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...
[OK] (elapsed time was 0 seconds)
R1(config)#ip ssh version 2
R1(config)#line vty 0 4
R1(config-line)#login local
R1(config-line)#tr
R1(config-line)#transport in
R1(config-line)#transport input ssh
```
## Ubuntu
```
root@ubuntu:/home/user/Desktop# ssh -oKexAlgorithms=+diffie-hellman-group1-sha1 -c aes256-cbc test1@192.168.52.171
```