## ip source
![](../pic/27_1.png)
```
R3(config)#ip route 3.3.3.0 255.255.255.0 192.168.1.3
R3(config)#do sh ip route
      1.0.0.0/8 is variably subnetted, 2 subnets, 2 masks
C        1.1.1.0/24 is directly connected, Loopback1
L        1.1.1.1/32 is directly connected, Loopback1
      3.0.0.0/24 is subnetted, 1 subnets
S        3.3.3.0 [1/0] via 192.168.1.3
      192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.1.0/24 is directly connected, Ethernet0/0
L        192.168.1.1/32 is directly connected, Ethernet0/0
      192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
C        192.168.2.0/24 is directly connected, Ethernet0/1
L        192.168.2.1/32 is directly connected, Ethernet0/1
```
```
R1(config)#ip route 1.1.1.0 255.255.255.0 192.168.1.1
R1(config)#do ping 1.1.1.1
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 1.1.1.1, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/2 ms
```
```
R3(config)#do ping 3.3.3.3
Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 3.3.3.3, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 1/1/1 ms
```
## ftp伺服器

[參考網站](https://tsaiyuyan.github.io/2020/05/19/linux/ubuntu-an-zhuang-tftp-server/)


```
R1#copy startup-config tftp:
Address or name of remote host []? 192.168.52.161
Destination filename [r1-confg]?
!!
711 bytes copied in 0.009 secs (79000 bytes/sec)
```

```
root@ubuntu:/var/lib# cd tftpboot/
root@ubuntu:/var/lib/tftpboot# ls
r1-confg
```

```
Router#copy tftp: startup-config
Address or name of remote host []? 192.168.52.161
Source filename []? r1-confg
Destination filename [startup-config]?
Accessing tftp://192.168.52.161/r1-confg...
Loading r1-confg from 192.168.52.161 (via Ethernet0/2): !
[OK - 711 bytes]
711 bytes copied in 9.015 secs (79 bytes/sec)
Router#copy startup-config run
Destination filename [running-config]?

R1#sh ip int br
Interface              IP-Address      OK? Method Status                Protocol
Ethernet0/0            192.168.3.3     YES TFTP   administratively down down
Ethernet0/1            192.168.1.3     YES TFTP   administratively down down
Ethernet0/2            unassigned      YES TFTP   administratively down down
Ethernet0/3            unassigned      YES unset  administratively down down
Loopback1              3.3.3.3         YES TFTP   up                    up
```


LOW CAPEX
LOW 