## float route

## 尋徑
1. 靜態尋徑  
2. 動態尋徑  
   > 距離向量  
   > 連線狀態尋徑  
   > 混合式尋徑  

## 距離向量尋徑
路由器彼此交換訊息  
   > ex. RIP，EIGRP  
## RIP
缺點 收斂時間太久  
## 連線狀態尋徑
從一個節點向外傳遞路由訊息  
   > ex. 戴克斯特拉演算法  
## 混和式尋徑
結合距離向量尋徑和連線狀態尋徑
```
router rip
version 2
no au
no auto-summary
```

## VPC1
```
ip 192.168.1.1 255.255.255.0 192.168.1.254
VPCS> ping 192.168.2.1

84 bytes from 192.168.2.1 icmp_seq=1 ttl=62 time=3.928 ms
84 bytes from 192.168.2.1 icmp_seq=2 ttl=62 time=1.822 ms
84 bytes from 192.168.2.1 icmp_seq=3 ttl=62 time=1.508 ms
84 bytes from 192.168.2.1 icmp_seq=4 ttl=62 time=1.528 ms
```
## VPC2
```
ip 192.168.2.1 255.255.255.0 192.168.2.254
```
## VPC3
```
ip 192.168.3.1 255.255.255.0 192.168.3.254
VPCS> ping 192.168.1.1

84 bytes from 192.168.1.1 icmp_seq=1 ttl=61 time=3.696 ms
84 bytes from 192.168.1.1 icmp_seq=2 ttl=61 time=2.333 ms
84 bytes from 192.168.1.1 icmp_seq=3 ttl=61 time=4.051 ms
84 bytes from 192.168.1.1 icmp_seq=4 ttl=61 time=2.960 ms
84 bytes from 192.168.1.1 icmp_seq=5 ttl=61 time=2.302 ms
```
## R1
```
Router(config)#int e0/0
Router(config-if)#ip addr 192.168.1.254 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#int e0/1
Router(config-if)#ip addr 12.1.1.1 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-router)#network 12.1.1.0
Router(config-router)#network 192.168.1.0
```
## R2
```
Router(config)#int e0/0
Router(config-if)#ip addr 192.168.2.254 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#int e0
Router(config-if)#int e0/1
Router(config-if)#ip addr 12.1.1.2 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#int e
Router(config-if)#int e0/2
Router(config-if)#ip addr 23.1.1.2 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#no au
Router(config-router)#no auto-summary
Router(config-router)#network 12.1.1.0
Router(config-router)#network 23.1.1.0
Router(config-router)#network 192.168.2.0
```
## R3
```
Router(config)#int e0/0
Router(config-if)#ip addr 192.168.3.254 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#int e0/1
Router(config-if)#ip addr 23.1.1.3 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#no au
Router(config-router)#no auto-summary
Router(config-router)#new
Router(config-router)#net
Router(config-router)#network 23.1.1.0
Router(config-router)#network 192.168.3.0
```